{
    "home": "Главная",
    "about": "О себе",
    "skills": "Навыки",
    "projects": "Проекты",
    "contact": "Контакты",
    "name": "Данил Гордеев",
    "whoIAm": "Веб-разработчик, создающий удобные и эффективные веб-приложения",
    "goal": "Увлечен технологиями и всегда открыт для изучения нового",
    "suggest": "Давайте вместе воплотим ваши идеи в жизнь и достигнем отличных результатов!",
    "firstExperience": "Первый опыт в разработке получен при создании браузерного расширения для упрощения работы с расписанием университета. Расширение позволило автоматизировать процесс обновления данных и способствовало определению местонахождения преподавателей, что значительно упростило процесс своевременного получения информации. Погружение в разработку, реализация поставленных задач и стремление создавать полезные приложения стали ключевыми этапами в определении моей профессиональной деятельности. ",
    "education": "Окончил бакалавриат по направлению «Прикладная информатика» и магистратуру по программе «Электронное обучение и цифровые платформы» в Псковском государственном университете. В рамках научной деятельности занимался публикационной деятельностью в аспирантуре Московского финансово-юридического университета.",
    "goals": "Стремлюсь к постоянному совершенствованию своих навыков и расширению знаний в области разработки. Моя цель — не только быть ценным и надежным членом команды, но и вносить свой вклад в создание инновационных решений. Активно ищу возможности для обмена опытом с профессионалами, чтобы развиваться и следовать последним тенденциям современной разработки.",
    "dynamicProgramming": "Динамическое программирование для эффективного обучения: максимизация результатов через оптимальное распределение времени",
    "location_1": "Национальный Суперкомпьютерный Форум 2023.",
    "date_1": "Переславль-Залесский, ИПС имени А.К. Айламазяна РАН, 28 ноября – 01 декабря 2023 года",
    "dynamicProgrammingDescription": "Представлен метод динамического программирования, позволяющий решить задачу оптимального распределения времени между занятиями с целью максимизации уровня освоения материала. При этом предполагается, что уровень освоения занятия пропорционален затраченному времени на него, и скорость освоения следующего занятия обратно пропорциональна уровню освоения предыдущего. Сформулирована постановка задачи, описана математическая модель динамического программирования, определено рекуррентное соотношение Беллмана и представлен программный код модели динамического программирования, реализующий функции условной и безусловной оптимизации. Последовательный вызов функций при заданных аргументах позволил получить управляющие последовательности, переводящие управляемую систему в состояние, при котором результат управления максимален.",
    "applicationAI": "Применение технологии искусственного интеллекта для улучшения качества образования",
    "location_2": "",
    "date_2": "Красноярск, Красноярский государственный педагогический университет им. В.П. Астафьева, 19–22 сентября 2023 года",
    "applicationAIDescription": "Технология искусственного интеллекта позволяет сформировать новые подходы к решению проблем в той или иной сфере деятельности. В работе представлен один из возможных вариантов применения технологии искусственного интеллекта в сфере образования, принцип интеграции технологии искусственного интеллекта в образовательную платформу посредством программного интерфейса и практическое применение при решении реальной образовательной задачи.",
    "informationSecurity": "Современные подходы обеспечения информационной безопасности веб-приложений",
    "location_3": "",
    "date_3": "Москва, Московский финансово-юридический университет, 2024 год",
    "informationSecurityDescription": "В условиях постоянного развития технологий и расширения функциональности веб-приложений, актуальность вопросов информационной безопасности в современном информационном обществе становится все более значимой. В работе рассмотрены основные этапы развития веб-приложений и эволюция их уязвимостей. Проанализированы методы обеспечения безопасности веб-приложений, включая традиционные средства защиты, такие как брандмауэры и системы обнаружения/предотвращения вторжений. Выявлены ограничения данных методов в обнаружении новых, неизвестных угроз, и представлены современные подходы к обеспечению информационной безопасности. Определена важность использования оптимальной стратегии, включающей комбинацию различных методов обеспечения безопасности веб-приложений. В результате исследования подчеркнуто, что эффективная стратегия безопасности должна учитывать конкретные потребности и задачи каждого приложения, а также постоянно обновляться для адаптации к новым угрозам.",
    "roleAI": "Роль искусственного интеллекта в информационной безопасности",
    "location_4": "",
    "date_4": "Москва, Московский университет им. С.Ю. Витте, 26 января 2024 года",
    "roleAIDescription": "Раскрыта актуальность и роль применения искусственного интеллекта в обеспечении информационной безопасности. Проведен анализ научных исследований в данной области. Описана эволюция применения искусственного интеллекта в обеспечении информационной безопасности, выявлены основные методы и подходы. Проанализированы существующие примеры успешного использования искусственного интеллекта в области информационной безопасности. Рассмотрены текущие проблемы применения технологии искусственного интеллекта и пути их решения. Определены перспективные тенденции развития искусственного интеллекта в области информационной безопасности.",
    "stackMern": "Обзор стека MERN для разработки образовательной платформы",
    "location_5": "",
    "date_5": "Москва, Московский финансово-юридический университет, 24–28 апреля 2023 года",
    "stackMernDescription": "Непрерывное развитие информационных технологий и их внедрение в сферу образования определяет потребность в разработке качественных, эффективных и масштабируемых образовательных платформ. Их разработка ведется на основе современных веб-технологий, которые предоставляют возможность организации полноценного клиент-серверного взаимодействия. Рассмотрен высокоэффективный стек подобных технологий и его основные компоненты, предназначенные для обработки данных на различных уровнях реализации образовательной платформы. Определены достоинства нереляционной базы данных над классической реляционной при взаимодействии с информацией. Выявлены преимущества одностраничных приложений. Приведен анализ двух технологий с блокирующим и неблокирующим вводом-выводом, отображающий количество запросов в секунду и среднего времени выполнения этих запросов при повышении уровня параллелизма. Описано взаимодействие стека MERN с компонентами MVC архитектуры.",
    "developmentSkills": "Формирование практических навыков у учащихся технических направлений при изучении веб-программирования",
    "location_6": "",
    "date_6": "Москва, Московский университет им. С.Ю. Витте, 27 января 2023 года",
    "developmentSkillsDescription": "Предложен подход к обучению веб-программированию, основанный на практическом применении изученного материала, проектной работе в команде и взаимном оценивании проектных работ. Целью исследования является разработка курса по формированию практических навыков у учащихся технических направлений при изучении веб-программирования. Недостаточная разработанность методических основ по формированию практических компетенций веб-программирования говорит об актуальности исследования. При исследовании были задействованы методы анализа, проектной деятельности и взаимной оценки проектной деятельности. В результате исследования систематизированы теоретические разделы по ряду веб-технологий, выбрана платформа для алгоритмического развития навыков учащихся, разработано веб-приложение, анализирующее успеваемость по выполнению алгоритмических задач, разработаны учебные проекты и техническая спецификация к ним, сформулированы критерии оценивания проектных работ и описаны этапы семинарских занятий по взаимному оцениванию."
  }