{
    "home": "Главная",
    "about": "О себе",
    "skills": "Навыки",
    "projects": "Проекты",
    "contact": "Контакты",
    "name": "Данил Гордеев",
    "whoIAm": "Веб-разработчик, который создает удобные и эффективные веб-приложения",
    "goal": "Увлечен технологиями и всегда открыт для изучения нового",
    "suggest": "Давайте вместе воплотим ваши идеи в жизнь и достигнем отличных результатов!",
    "firstExperience": "Первый опыт в разработке приложений был связан с созданием браузерного расширения для упрощения работы с расписанием университета. Расширение позволило автоматизировать процесс обновления данных и способствовало определению местонахождения преподавателей, что значительно упростило процесс своевременного получения информации. Погружение в разработку, реализация поставленных задач и стремление создавать полезные приложения стали ключевыми этапами в определении моей профессиональной деятельности. ",
    "education": "Окончил бакалавриат по направлению «Прикладная информатика» и магистратуру по программе «Электронное обучение и цифровые платформы» в Псковском государственном университете. В рамках научной деятельности занимался публикационной деятельностью в аспирантуре Московского финансово-юридического университета.",
    "goals": "Стремлюсь к постоянному совершенствованию своих навыков и расширению знаний в области разработки. Моя цель — не только быть ценным и надежным членом команды, но и вносить свой вклад в создание инновационных решений. Активно ищу возможности для обмена опытом с профессионалами, чтобы развиваться и следовать последним тенденциям современной разработки.",
    "articleTitle_1": "Динамическое программирование для эффективного обучения: максимизация результатов через оптимальное распределение времени",
    "articleDescription_1": "Представлен метод динамического программирования, позволяющий решить задачу оптимального распределения времени между занятиями с целью максимизации уровня освоения материала. При этом предполагается, что уровень освоения занятия пропорционален затраченному времени на него, и скорость освоения следующего занятия обратно пропорциональна уровню освоения предыдущего. Сформулирована постановка задачи, описана математическая модель динамического программирования, определено рекуррентное соотношение Беллмана и представлен программный код модели динамического программирования, реализующий функции условной и безусловной оптимизации. Последовательный вызов функций при заданных аргументах позволил получить управляющие последовательности, переводящие управляемую систему в состояние, при котором результат управления максимален.",
    "articleTitle_2": "Применение технологии искусственного интеллекта для улучшения качества образования",
    "articleDescription_2": "",
    "articleTitle_3": "Современные подходы обеспечения информационной безопасности веб-приложений",
    "articleDescription_3": "",
    "articleTitle_4": "Роль искусственного интеллекта в информационной безопасности",
    "articleDescription_4": "",
    "articleTitle_5": "Обзор стека MERN для разработки образовательной платформы",
    "articleDescription_5": "",
    "articleTitle_6": "Формирование практических навыков у учащихся технических направлений при изучении веб-программирования",
    "articleDescription_6": ""
  }