{
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact",
    "name": "Danil Gordeev",
    "whoIAm": "A web developer passionate about building user-friendly and effective web applications",
    "goal": "I’m excited about technology and always open to learning new things",
    "suggest": "Let’s bring your ideas to life and achieve great results together!",
    "firstExperience": "My first experience in application development was related to creating a browser extension aimed at simplifying the management of my university's schedule. The extension automated the process of updating data and facilitated the identification of instructors' locations, which significantly streamlined the process of obtaining timely information. Immersing myself in development, accomplishing set goals, and striving to create useful applications became key milestones in shaping my professional path.",
    "education": "I earned a Bachelor’s degree in Applied Informatics and a Master’s degree in E-Learning and Digital Platforms from Pskov State University. As part of my academic pursuits, I was involved in publishing activities during my postgraduate studies at Moscow Financial and Law University.",
    "goals": "I am committed to continuously improving my skills and expanding my knowledge in the field of development. My goal is not only to be a valuable and reliable team member but also to contribute to the creation of innovative solutions. I actively seek opportunities to exchange experiences with professionals to grow and stay aligned with the latest trends in modern development.",
    "readMore": "read in full",
    "dynamicProgramming": "Dynamic Programming for Effective Learning: Maximizing Results Through Optimal Time Allocation",
    "location_1": "National Supercomputer Forum 2023.",
    "date_1": "Pereslavl-Zalessky, A.K. Ailamazyan Institute of Program Systems RAS, November 28 – December 1, 2023",
    "dynamicProgrammingDescription": "A dynamic programming method is presented to solve the problem of optimal time allocation between activities to maximize the level of material mastery. It assumes that the mastery level of an activity is proportional to the time spent on it, and the learning speed of the next activity is inversely proportional to the mastery level of the previous one. The problem statement is formulated, the mathematical model of dynamic programming is described, the Bellman recurrence relation is defined, and the program code of the dynamic programming model implementing conditional and unconditional optimization functions is presented. Sequential calls of the functions with given arguments yielded control sequences that bring the controlled system to a state where the control result is maximized.",
    "applicationAI": "Application of Artificial Intelligence Technology to Improve Education Quality",
    "location_2": "",
    "date_2": "Krasnoyarsk, V.P. Astafiev Krasnoyarsk State Pedagogical University, September 19–22, 2023",
    "applicationAIDescription": "Artificial intelligence technology enables new approaches to solving problems in various fields of activity. The study presents one of the possible applications of artificial intelligence technology in education, the principle of integrating artificial intelligence technology into an educational platform through a programming interface, and its practical application in solving a real educational problem.",
    "informationSecurity": "Modern Approaches to Ensuring Information Security of Web Applications",
    "location_3": "",
    "date_3": "Moscow, Moscow Finance and Law University, 2024",
    "informationSecurityDescription": "In the context of constant technological advancement and expanding functionality of web applications, the relevance of information security issues in the modern information society becomes increasingly significant. The study examines the main stages of web application development and the evolution of their vulnerabilities. Security methods for web applications are analyzed, including traditional protection tools such as firewalls and intrusion detection/prevention systems. The limitations of these methods in detecting new, unknown threats are identified, and modern approaches to ensuring information security are presented. The importance of using an optimal strategy that combines various security methods for web applications is determined. The study emphasizes that an effective security strategy should consider the specific needs and tasks of each application and be continuously updated to adapt to new threats.",
    "roleAI": "The Role of Artificial Intelligence in Information Security",
    "location_4": "",
    "date_4": "Moscow, S.Yu. Witte Moscow University, January 26, 2024",
    "roleAIDescription": "The relevance and role of applying artificial intelligence in ensuring information security are revealed. An analysis of scientific research in this area is conducted. The evolution of artificial intelligence application in information security is described, and the main methods and approaches are identified. Existing examples of successful use of artificial intelligence in the field of information security are analyzed. Current challenges in applying artificial intelligence technology and ways to address them are considered. Prospective trends in the development of artificial intelligence in the field of information security are identified.",
    "stackMern": "Overview of the MERN Stack for Educational Platform Development",
    "location_5": "",
    "date_5": "Moscow, Moscow Finance and Law University, April 24–28, 2023",
    "stackMernDescription": "The continuous development of information technologies and their implementation in the education sector determine the need for the development of high-quality, efficient, and scalable educational platforms. These platforms are developed based on modern web technologies, which enable full-fledged client-server interaction. A highly efficient stack of such technologies and its main components, designed for data processing at various levels of educational platform implementation, are examined. The advantages of non-relational databases over classical relational ones in information interaction are determined. The benefits of single-page applications are highlighted. An analysis of two technologies with blocking and non-blocking input/output is presented, showing the number of requests per second and average execution time of these requests with increased parallelism levels. The interaction of the MERN stack with MVC architecture components is described.",
    "developmentSkills": "Developing Practical Skills in Technical Students While Studying Web Programming",
    "location_6": "",
    "date_6": "Moscow, S.Yu. Witte Moscow University, January 27, 2023",
    "developmentSkillsDescription": "An approach to teaching web programming based on the practical application of learned material, project teamwork, and mutual evaluation of project work is proposed. The goal of the study is to develop a course aimed at building practical skills in technical students while studying web programming. The insufficient development of methodological foundations for forming practical web programming competencies underscores the relevance of the study. The research employed methods of analysis, project activity, and mutual evaluation of project activities. As a result of the study, theoretical sections on several web technologies were systematized, a platform for algorithmic skills development was chosen, a web application analyzing performance in algorithmic tasks was developed, educational projects and their technical specifications were created, evaluation criteria for project work were formulated, and the stages of seminar sessions on mutual evaluation were described.",
    "projectDescription_1": "During the training, I became interested in the process of implementing my own audio player. As a result, a small project was written which I plan to rewrite with a fresh look and new technologies.",
    "projectDescription_2": "This website, React Pizza, is an online service for ordering pizzas. It features a modern, minimalist design with a user-friendly interface. On the main page, users can browse a catalog of various pizzas with filters by category (e.g., meat, vegetarian, spicy, etc.). There is also an option to sort by popularity."
  }